AdelaideAuto-IDLab/NoisFre/src/nRF_demo_project/nrf5-ble-demo/main.c
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    //FROM_SERVICE_TUTORIAL: Add code to initialize the services used by the application.
    our_service_init(&m_our_service);

}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising.");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_IDLE:
            sleep_mode_enter();
            break;

        default:
            break;
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code = NRF_SUCCESS;
		ble_gatts_evt_write_t const * p_evt_write;
		int idx = 0;
		uint32_t addr = 0;
		uint32_t leng = 0;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
						nrf_gpio_pin_set(LED_B);
						nrf_gpio_pin_set(LED_G);
						nrf_gpio_pin_set(LED_R);
            break;

        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected.");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
						SEGGER_RTT_printf(0, "Connection handle: 0x%#04x\n", m_conn_handle);

            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
				case BLE_GATTS_EVT_WRITE:
						SEGGER_RTT_WriteString(0, "GATT characteristic is written.\n"); // Print message to RTT to the application flow
						p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
						SEGGER_RTT_printf(0, "UUID: 0x%#04x\n", p_evt_write->uuid.uuid);
						SEGGER_RTT_printf(0, "Handle: 0x%#02x\n", p_evt_write->handle);
						SEGGER_RTT_printf(0, "Handle: %d\n", p_evt_write->handle);
						SEGGER_RTT_printf(0, "Length: 0x%#04x\n", p_evt_write->len);
						SEGGER_RTT_printf(0, "Data: ");
						for(idx = 0; idx<p_evt_write->len;idx++){
							SEGGER_RTT_printf(0, "0x%#02x, ", p_evt_write->data[idx]);
						}
						SEGGER_RTT_printf(0, "\n ");
						switch (p_evt_write->uuid.uuid){
							case CHAR_UUID_CMD:
								NRF_LOG_DEBUG("Command received.");
								if(0xff == p_evt_write->data[0]){// reset status
									our_state_update(p_ble_evt,0x00);
									nrf_gpio_pin_set(LED_B);
									nrf_gpio_pin_set(LED_G);
									nrf_gpio_pin_clear(LED_R);
								}
								if(0x10 == p_evt_write->data[0]){// do attestation
									uint8_t response[16];
										ret_code_t err_code;
									// Go straight to the characteristic
									uint8_t	challenge[16];
									memset(challenge,0,16);
									ble_gatts_value_t chaStruct = {.len = sizeof(challenge),
																						 .offset = 0,
																						 .p_value = challenge};
									err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle, m_our_service.CHA_handles.value_handle, &chaStruct);
									
																						 
																						 
									uint8_t	message[4];
									memset(message,0,4);
									ble_gatts_value_t mesStruct = {.len = sizeof(message),
																						 .offset = 0,
																						 .p_value = message};
									err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle, m_our_service.ADD_handles.value_handle, &mesStruct);
									uint8_t *msg_data = (uint8_t *)((uint32_t )(message[0]<<24)|(uint32_t )(message[1]<<16)|(uint32_t )(message[2]<<8)|(uint32_t )(message[3]<<0));
																						 
																						 
																						 
