AdelaideAuto-IDLab/NoisFre/src/nRF_demo_project/nrf5-ble-demo/main.c
									uint8_t	length[4];
									memset(length,0,4);
									ble_gatts_value_t lenStruct = {.len = sizeof(length),
																						 .offset = 0,
																						 .p_value = length};
									err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle, m_our_service.LEN_handles.value_handle, &lenStruct);
									uint32_t msg_len = (uint32_t )(length[0]<<24)|(uint32_t )(length[1]<<16)|(uint32_t )(length[2]<<8)|(uint32_t )(length[3]<<0);
									APP_ERROR_CHECK(err_code);
									SEGGER_RTT_printf(0, "Challenge: ");
									int idx = 0;
									for(idx = 0; idx<sizeof(challenge)/sizeof(challenge[0]);idx++){
										SEGGER_RTT_printf(0, "0x%#02x, ", challenge[idx]);
									}
									SEGGER_RTT_printf(0, "\n");
									SEGGER_RTT_printf(0, "Address: 0x%#08x\n",msg_data);
									SEGGER_RTT_printf(0, "Length: 0x%#08x\n",msg_len);
									doTINA((uint8_t*)response, (uint8_t*)e, (uint8_t*)challenge, (uint8_t*)msg_data, msg_len, NULL, NULL, elaborate);
									ble_gatts_value_t respStruct;
									respStruct.p_value = response;
									respStruct.len = 16;
									respStruct.offset = 0;
									sd_ble_gatts_value_set(p_ble_evt->evt.gap_evt.conn_handle,m_our_service.REP_handles.value_handle, &respStruct);
									our_state_update(p_ble_evt,0x20);
									nrf_gpio_pin_set(LED_B);
									nrf_gpio_pin_set(LED_R);
									nrf_gpio_pin_clear(LED_G);
								}
								if(0xA0 == p_evt_write->data[0]){// view e for debug
									getPUF(e);
									ble_gatts_value_t testStruct;
									testStruct.p_value = e;
									testStruct.len = 16;
									testStruct.offset = 0;
									sd_ble_gatts_value_set(p_ble_evt->evt.gap_evt.conn_handle,m_our_service.REP_handles.value_handle, &testStruct);
									NRF_LOG_DEBUG("e is on display");
									our_state_update(p_ble_evt,0xA0);
									nrf_gpio_pin_set(LED_B);
									nrf_gpio_pin_clear(LED_R);
									nrf_gpio_pin_clear(LED_G);
								}
								if(0xB0 == p_evt_write->data[0]){// Power down SRAM
									sd_power_ram_power_clr(2,0xFFFFFFFF);
									uint32_t mp0;
									sd_power_ram_power_get(2,&mp0);
									NRF_LOG_DEBUG("RAM POWER state bank 0. %x",mp0);
									sd_power_ram_power_clr(3,0xFFFFFFFF);
									sd_power_ram_power_clr(4,0xFFFFFFFF);
									sd_power_ram_power_clr(5,0xFFFFFFFF);
									sd_power_ram_power_clr(6,0xFFFFFFFF);
									int erro = sd_power_ram_power_clr(7,0x00000003);
									NRF_LOG_DEBUG("RAM POWER erro code. %d",erro);
									our_state_update(p_ble_evt,0xB1);
									nrf_gpio_pin_clear(LED_B);
									nrf_gpio_pin_clear(LED_R);
									nrf_gpio_pin_set(LED_G);
								}
								if(0xB1 == p_evt_write->data[0]){// Power up SRAM
									sd_power_ram_power_set(2,0x00000003);
									uint32_t mp0;
									sd_power_ram_power_get(2,&mp0);
									NRF_LOG_DEBUG("RAM POWER state bank 0. %x",mp0);
									sd_power_ram_power_set(3,0x00000003);
									sd_power_ram_power_set(4,0x00000003);
									sd_power_ram_power_set(5,0x00000003);
									sd_power_ram_power_set(6,0x00000003);
									int erro = sd_power_ram_power_set(7,0x00000003);
									NRF_LOG_DEBUG("RAM POWER erro code. %d",erro);
									our_state_update(p_ble_evt,0x00);
									nrf_gpio_pin_set(LED_B);
									nrf_gpio_pin_clear(LED_R);
									nrf_gpio_pin_set(LED_G);
								}
								if(0xBF == p_evt_write->data[0]){// Power up SRAM
									uint8_t *ram_start = (uint8_t *)0x20004000;
									memset(ram_start,1,0xC000);
									our_state_update(p_ble_evt,0x00);
									nrf_gpio_pin_clear(LED_B);
									nrf_gpio_pin_clear(LED_R);
									nrf_gpio_pin_clear(LED_G);
								}
							break;
							case CHAR_UUID_CHA:
								if(0x00 != our_state_get(p_ble_evt)){
									NRF_LOG_DEBUG("Device is not in the IDEL state 0x00.");
									break;
								}
								if(p_evt_write->len < 16){
									NRF_LOG_DEBUG("Chanllenege length is not long enough.");
								}else{
									NRF_LOG_DEBUG("Chanllenege received.");
									our_state_update(p_ble_evt,0x01); // switch to challenged state
								}
							break;
							case CHAR_UUID_ADD:
								if(0x01 != our_state_get(p_ble_evt)){
									NRF_LOG_DEBUG("Device is not in the CHA state 0x01.");
									break;
								}
								addr = (p_evt_write->data[0]<<24)|(p_evt_write->data[1]<<16)|(p_evt_write->data[2]<<8)|(p_evt_write->data[3]);
								NRF_LOG_DEBUG("Address received %d.",addr);
								our_state_update(p_ble_evt,0x02); // switch to addressed state
							break;
							case CHAR_UUID_LEN:
								if(0x02 != our_state_get(p_ble_evt)){
									NRF_LOG_DEBUG("Device is not in the ADDR state 0x02.");
									break;
								}
								leng = (p_evt_write->data[0]<<24)|(p_evt_write->data[1]<<16)|(p_evt_write->data[2]<<8)|(p_evt_write->data[3]);
								NRF_LOG_DEBUG("Length received %d.",leng);
								our_state_update(p_ble_evt,0x10); // switch to ready state
								nrf_gpio_pin_clear(LED_B);
								nrf_gpio_pin_set(LED_R);
							break;
							default:
								break;
						}
				break;

        default:
            // No implementation needed.
            break;
    }

		
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    //OUR_JOB: Step 3.C Call ble_our_service_on_ble_evt() to do housekeeping of ble connections related to our service and characteristics
		NRF_SDH_BLE_OBSERVER(m_our_service_observer, APP_BLE_OBSERVER_PRIO, ble_our_service_on_ble_evt, (void*) &m_our_service);
	
		

	
